module rom (
    input  wire [7:0]  addr,
    output reg  [15:0] data
);
    always @(*) begin
        case(addr)
            // ==========================================
            // "鹦鹉学舌" (Echo) 操作系统
            // 逻辑: 等待接收 -> 收到后清空标志 -> 等待发送器空闲 -> 发送回去 -> 循环
            // ==========================================
            
            // --- 阶段一：死等外界键盘输入 ---
            // 0: IN R0, 5    (读端口0x05，获取信箱状态 rx_ready)
            8'd0: data = 16'b1010_00_00_00000101; 
            // 1: LDI R1, 0   (给 R1 赋值 0)
            8'd1: data = 16'b0001_01_00_00000000; 
            // 2: ADD R0, R1  (绝妙的汇编技巧：加上 0 等于没加，但如果此时 R0是0(没信)，这会触发 Z=1 标志)
            8'd2: data = 16'b0101_00_01_00000000; 
            // 3: JZ 0        (如果 Z=1 即没信，无条件跳回第 0 行，死循环干等)
            8'd3: data = 16'b1001_00_00_00000000; 

            // --- 阶段二：终于收到信了，取信件 ---
            // 4: IN R2, 4    (读端口0x04，把听到的真正 ASCII 字符拿出来存进 R2)
            8'd4: data = 16'b1010_10_00_00000100; 
            // 5: OUT R0, 5   (给端口0x05随便写个数据，主板会关掉信箱指示灯 rx_ready)
            8'd5: data = 16'b1011_00_00_00000101; 

            // --- 阶段三：死等发送器(嘴巴)空闲 ---
            // 6: IN R0, 2    (读端口0x02，获取 tx_busy 状态，1代表正忙)
            8'd6: data = 16'b1010_00_00_00000010; 
            // 7: LDI R1, 0   
            8'd7: data = 16'b0001_01_00_00000000; 
            // 8: ADD R0, R1  (同理技巧：如果 R0是0代表不忙，此时触发 Z=1 标志)
            8'd8: data = 16'b0101_00_01_00000000; 
            // 9: JZ 11       (如果 Z=1 即不忙，跳过等待，跳到第 11 行去发送)
            8'd9: data = 16'b1001_00_00_00001011; 
            // 10: JMP 6      (走到这说明嘴巴正忙，强行跳回第 6 行继续等)
            8'd10: data = 16'b1000_00_00_00000110; 

            // --- 阶段四：把字符发送出去！ ---
            // 11: OUT R2, 1  (把 R2 刚才暂存的字符，丢给端口0x01发送器)
            8'd11: data = 16'b1011_10_00_00000001; 
            // 12: JMP 0      (大功告成，跳回第 0 行，等待电脑敲击下一个键盘按键)
            8'd12: data = 16'b1000_00_00_00000000; 

            default: data = 16'b0000_00_00_00000000; 
        endcase
    end
endmodule